; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_4 ?v2 ?v1)
             (pred_7 ?v4 ?v8)
             (pred_9 ?v2 ?v8)
             (pred_2 ?v10 ?v2 )
	     (pred_10 ?v2)
             (pred_11 ?v9)
             (pred_1 ?v4)
             (pred_3 ?v8)
             (pred_12 ?v2)
             (pred_8 ?v4)
             (pred_5 ?v2)
             (pred_6 ))



(:action op_4
:parameters (?v12 ?v11 ?v3 ?v5)
:precondition (and (pred_11 ?v12) (pred_11 ?v11) (pred_1 ?v3) (pred_3 ?v5)
          (pred_4 ?v12 ?v11) (pred_7 ?v3 ?v5)
                   (pred_9 ?v11 ?v5) (pred_10 ?v12) 
                   (pred_12 ?v11) (pred_8 ?v3))
:effect (and  (pred_5 ?v11) (not (pred_12 ?v11))))


(:action op_1
:parameters (?v12 ?v13)
:precondition (and (pred_11 ?v12) (pred_11 ?v13)
               (pred_10 ?v12) (pred_4 ?v12 ?v13) (pred_5 ?v13))
:effect (and (pred_10 ?v13) (not (pred_10 ?v12))))

(:action op_3
:parameters (?v12 ?v3)
:precondition (and (pred_11 ?v12) (pred_1 ?v3) 
                  (pred_10 ?v12) (pred_2 ?v3 ?v12) (pred_6 ))
:effect (and (pred_8 ?v3)
   (not (pred_2 ?v3 ?v12)) (not (pred_6 ))))


(:action op_2
:parameters (?v12 ?v6 ?v7)
:precondition (and (pred_11 ?v12) (pred_1 ?v6) (pred_1 ?v7)
                  (pred_10 ?v12) (pred_8 ?v7) (pred_2 ?v6 ?v12))
:effect (and (pred_8 ?v6) (pred_2 ?v7 ?v12)
        (not (pred_8 ?v7)) (not (pred_2 ?v6 ?v12))))

(:action op_5
:parameters (?v12 ?v3)
:precondition (and (pred_11 ?v12) (pred_1 ?v3) 
                  (pred_10 ?v12) (pred_8 ?v3))
:effect (and (pred_6 ) (pred_2 ?v3 ?v12) (not (pred_8 ?v3)))))

; problem
(define (problem grid-3-3-2-2-2)
    (:domain grid)
    (:objects
    obj_02 obj_01 obj_03 obj_11 obj_13 obj_04 obj_07 obj_09 obj_10
    obj_12 obj_08
    obj_05 obj_06
    )

    (:init
       (pred_6)

       (pred_11 obj_02)
       (pred_11 obj_01)
       (pred_11 obj_03)
       (pred_11 obj_11)
       (pred_11 obj_13)
       (pred_11 obj_04)
       (pred_11 obj_07)
       (pred_11 obj_09)
       (pred_11 obj_10)
       (pred_3 obj_12)
       (pred_3 obj_08)
       (pred_1 obj_05)
       (pred_1 obj_06)

       (pred_4 obj_02 obj_11)
       (pred_4 obj_02 obj_01)
       (pred_4 obj_01 obj_13)
       (pred_4 obj_01 obj_03)
       (pred_4 obj_01 obj_02)
       (pred_4 obj_03 obj_04)
       (pred_4 obj_03 obj_01)
       (pred_4 obj_11 obj_07)
       (pred_4 obj_11 obj_13)
       (pred_4 obj_11 obj_02)
       (pred_4 obj_13 obj_09)
       (pred_4 obj_13 obj_04)
       (pred_4 obj_13 obj_01)
       (pred_4 obj_13 obj_11)
       (pred_4 obj_04 obj_10)
       (pred_4 obj_04 obj_03)
       (pred_4 obj_04 obj_13)
       (pred_4 obj_07 obj_09)
       (pred_4 obj_07 obj_11)
       (pred_4 obj_09 obj_10)
       (pred_4 obj_09 obj_13)
       (pred_4 obj_09 obj_07)
       (pred_4 obj_10 obj_04)
       (pred_4 obj_10 obj_09)
       (pred_12 obj_02)
       (pred_12 obj_01)
       (pred_9  obj_02 obj_12)
       (pred_9  obj_01 obj_08)
       (pred_5 obj_03)
       (pred_5 obj_11)
       (pred_5 obj_13)
       (pred_5 obj_04)
       (pred_5 obj_07)
       (pred_5 obj_09)
       (pred_5 obj_10)

       (pred_7  obj_05 obj_12)
       (pred_7  obj_06 obj_08)
       (pred_2 obj_05 obj_11)
       (pred_2 obj_06 obj_09)
       (pred_10 obj_07)
    )

    (:goal (and
       (pred_2 obj_05 obj_09)
       (pred_2 obj_06 obj_04)
    ))
(:constraints
  (always (not (pred_10 obj_13)))
)
)

; plan
1. (op_1 obj_07 obj_09)
   deleted: (pred_10 obj_07)
   added: (pred_10 obj_09)
   goals met: 0 of 2
2. (op_3 obj_09 obj_06)
   deleted: (pred_2 obj_06 obj_09) (pred_6)
   added: (pred_8 obj_06)
   goals met: 0 of 2
3. (op_1 obj_09 obj_07)
   deleted: (pred_10 obj_09)
   added: (pred_10 obj_07)
   goals met: 0 of 2
4. (op_1 obj_07 obj_11)
   deleted: (pred_10 obj_07)
   added: (pred_10 obj_11)
   goals met: 0 of 2
5. (op_2 obj_11 obj_05 obj_06)
   deleted: (pred_8 obj_06) (pred_2 obj_05 obj_11)
   added: (pred_8 obj_05) (pred_2 obj_06 obj_11)
   goals met: 0 of 2
6. (op_1 obj_11 obj_07)
   deleted: (pred_10 obj_11)
   added: (pred_10 obj_07)
   goals met: 0 of 2
7. (op_1 obj_07 obj_09)
   deleted: (pred_10 obj_07)
   added: (pred_10 obj_09)
   goals met: 0 of 2
8. (op_5 obj_09 obj_05)
   deleted: (pred_8 obj_05)
   added: (pred_6) (pred_2 obj_05 obj_09)
   goals met: 1 of 2
9. (op_1 obj_09 obj_07)
   deleted: (pred_10 obj_09)
   added: (pred_10 obj_07)
   goals met: 1 of 2
10. (op_1 obj_07 obj_11)
   deleted: (pred_10 obj_07)
   added: (pred_10 obj_11)
   goals met: 1 of 2
11. (op_3 obj_11 obj_06)
   deleted: (pred_2 obj_06 obj_11) (pred_6)
   added: (pred_8 obj_06)
   goals met: 1 of 2
12. (op_1 obj_11 obj_07)
   deleted: (pred_10 obj_11)
   added: (pred_10 obj_07)
   goals met: 1 of 2
13. (op_1 obj_07 obj_09)
   deleted: (pred_10 obj_07)
   added: (pred_10 obj_09)
   goals met: 1 of 2
14. (op_1 obj_09 obj_10)
   deleted: (pred_10 obj_09)
   added: (pred_10 obj_10)
   goals met: 1 of 2
15. (op_1 obj_10 obj_04)
   deleted: (pred_10 obj_10)
   added: (pred_10 obj_04)
   goals met: 1 of 2
16. (op_5 obj_04 obj_06)
   deleted: (pred_8 obj_06)
   added: (pred_6) (pred_2 obj_06 obj_04)
   goals met: 2 of 2
